Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: :cpp:enumerator:`LV_ARCLABEL_TEXT_ALIGN_DEFAULT` Uses the default alignment.
it_it: :cpp:enumerator:`LV_ARCLABEL_TEXT_ALIGN_DEFAULT` Utilizza l'allineamento di default.

source: :cpp:enumerator:`LV_ARCLABEL_TEXT_ALIGN_LEADING` Aligns text to the leading edge of the arc.
it_it: :cpp:enumerator:`LV_ARCLABEL_TEXT_ALIGN_LEADING` Allinea il testo al bordo iniziale dell'arco.

source: :cpp:enumerator:`LV_ARCLABEL_TEXT_ALIGN_TRAILING` Aligns text to the trailing edge of the arc.
it_it: :cpp:enumerator:`LV_ARCLABEL_TEXT_ALIGN_TRAILING` Allinea il testo al bordo finale dell'arco.

source: :cpp:enumerator:`LV_ARC_MODE_NORMAL` Indicator Arc is drawn clockwise from minimum to current value.
it_it: :cpp:enumerator:`LV_ARC_MODE_NORMAL` L'arco indicatore viene disegnato in senso orario dal valore minimo al valore corrente.

source: :cpp:enumerator:`LV_ARC_MODE_REVERSE` Indicator Arc is drawn counter-clockwise from maximum to current value.
it_it: :cpp:enumerator:`LV_ARC_MODE_REVERSE` L'Arco indicatore viene disegnato in senso antiorario dal valore massimo al valore corrente.

source: :cpp:enumerator:`LV_ARC_MODE_SYMMETRICAL` Indicator Arc is drawn from middle point to current value.
it_it: :cpp:enumerator:`LV_ARC_MODE_SYMMETRICAL` L'Arco indicatore viene disegnato dal punto centrale al valore corrente.

source: :cpp:enumerator:`LV_BAR_MODE_NORMAL` A normal Bar as described above
it_it: :cpp:enumerator:`LV_BAR_MODE_NORMAL` Una Bar normale come descritto sopra

source: :cpp:enumerator:`LV_BAR_MODE_RANGE` Allows setting the start value as well with :cpp:expr:`lv_bar_set_start_value(bar, new_value, LV_ANIM_ON/OFF)`.
it_it: :cpp:enumerator:`LV_BAR_MODE_RANGE` Consente anche di impostare il valore iniziale con :cpp:expr:`lv_bar_set_start_value(bar, new_value, LV_ANIM_ON/OFF)`.

source: :cpp:enumerator:`LV_BAR_MODE_SYMMETRICAL` Draws indicator from zero value to current value.
it_it: :cpp:enumerator:`LV_BAR_MODE_SYMMETRICAL` Disegna l'indicatore dal valore zero al valore corrente.

source: :cpp:enumerator:`LV_BASE_DIR_AUTO`: Auto detect base direction
it_it: :cpp:enumerator:`LV_BASE_DIR_AUTO`: Rilevamento automatico della direzione di base

source: :cpp:enumerator:`LV_BASE_DIR_LTR`: Left to Right base direction
it_it: :cpp:enumerator:`LV_BASE_DIR_LTR`: Direzione di base da sinistra a destra

source: :cpp:enumerator:`LV_BASE_DIR_RTL`: Right to Left base direction
it_it: :cpp:enumerator:`LV_BASE_DIR_RTL`: Direzione di base da destra a sinistra

source: :cpp:enumerator:`LV_BORDER_SIDE_ALL` applies to all sides, while :cpp:enumerator:`LV_BORDER_SIDE_INTERNAL` is used by higher layers (e.g. a table Widget) to calculate border sides.
it_it: :cpp:enumerator:`LV_BORDER_SIDE_ALL` si applica a tutti i lati, mentre :cpp:enumerator:`LV_BORDER_SIDE_INTERNAL` viene utilizzato dai layer superiori (ad esempio un Widget Table) per calcolare i lati del bordo.

source: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_CHECKABLE`: Enable toggling of :cpp:enumerator:`LV_STATE_CHECKED` when clicked.
it_it: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_CHECKABLE`: Abilita l'attivazione/disattivazione di :cpp:enumerator:`LV_STATE_CHECKED` quando cliccato.

source: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_CHECKED`: Make the button checked.
it_it: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_CHECKED`: Imposta il pulsante come selezionato.

source: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_CLICK_TRIG`: 1: Enables sending :cpp:enumerator:`LV_EVENT_VALUE_CHANGE` on ``CLICK``, 0: sends :cpp:enumerator:`LV_EVENT_VALUE_CHANGE` on ``PRESS``.
it_it: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_CLICK_TRIG`: 1: Abilita l'invio di :cpp:enumerator:`LV_EVENT_VALUE_CHANGE` al ``CLICK``, 0: invia :cpp:enumerator:`LV_EVENT_VALUE_CHANGE` al ``PRESS``.

source: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_CUSTOM_1`: Custom free-to-use flag
it_it: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_CUSTOM_1`: Flag personalizzato di libero utilizzo

source: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_CUSTOM_2`: Custom free-to-use flag
it_it: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_CUSTOM_2`: Flag personalizzato di libero utilizzo

source: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_DISABLED`: Disables button like :cpp:enumerator:`LV_STATE_DISABLED` on normal Widgets.
it_it: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_DISABLED`: Disabilita il pulsante come :cpp:enumerator:`LV_STATE_DISABLED` nei Widget normali.

source: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_HIDDEN`: Hides button; it continues to hold its space in layout.
it_it: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_HIDDEN`: Nasconde il pulsante; continua a occupare il suo spazio nel layout.

source: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_NO_REPEAT`: Do not emit :cpp:enumerator:`LV_EVENT_LONG_PRESSED_REPEAT` events while button is long-pressed.
it_it: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_NO_REPEAT`: Non emette eventi :cpp:enumerator:`LV_EVENT_LONG_PRESSED_REPEAT` mentre il pulsante è premuto a lungo.

source: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_POPOVER`: Show button text in a pop-over while being pressed.
it_it: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_POPOVER`: Mostra il testo del pulsante in un pop-over quando viene premuto.

source: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_RECOLOR`: Enable text recoloring with ``#color``
it_it: :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_RECOLOR`: Abilita la ricolorazione del testo con ``#color``

source: :cpp:enumerator:`LV_CHART_AXIS_PRIMARY_X`: Bottom axis
it_it: :cpp:enumerator:`LV_CHART_AXIS_PRIMARY_X`: Asse inferiore

source: :cpp:enumerator:`LV_CHART_AXIS_PRIMARY_Y`: Left axis
it_it: :cpp:enumerator:`LV_CHART_AXIS_PRIMARY_Y`: Asse sinistro

source: :cpp:enumerator:`LV_CHART_AXIS_SECONDARY_X`: Top axis
it_it: :cpp:enumerator:`LV_CHART_AXIS_SECONDARY_X`: Asse superiore

source: :cpp:enumerator:`LV_CHART_AXIS_SECONDARY_Y`: Right axis
it_it: :cpp:enumerator:`LV_CHART_AXIS_SECONDARY_Y`: Asse destro

source: :cpp:enumerator:`LV_CHART_TYPE_BAR`: Draw individual vertical bars for each point in each series.
it_it: :cpp:enumerator:`LV_CHART_TYPE_BAR`: Disegna barre verticali singole per ogni punto di ogni serie.

source: :cpp:enumerator:`LV_CHART_TYPE_LINE`: Draw lines between data points.
it_it: :cpp:enumerator:`LV_CHART_TYPE_LINE`: Disegna linee tra i punti dati.

source: :cpp:enumerator:`LV_CHART_TYPE_NONE`: Do not display any data.
it_it: :cpp:enumerator:`LV_CHART_TYPE_NONE`: Non visualizza alcun dato.

source: :cpp:enumerator:`LV_CHART_TYPE_SCATTER`: X/Y chart drawing point's and optionally lines between the points if line-width style values for :cpp:enumerator:`LV_PART_ITEMS` is a non-zero value, and the point's Y-value is something other than :c:macro:`LV_CHART_POINT_NONE`.
it_it: :cpp:enumerator:`LV_CHART_TYPE_SCATTER`: il grafico X/Y traccia i punti e, facoltativamente, le linee tra i punti se i valori dello stile di larghezza della linea per :cpp:enumerator:`LV_PART_ITEMS` sono diversi da zero e il valore Y del punto è diverso da :c:macro:`LV_CHART_POINT_NONE`.

source: :cpp:enumerator:`LV_CHART_TYPE_STACKED`: Draw vertical stacked bars where multiple data series are displayed as segments within a single bar for each data point.
it_it: :cpp:enumerator:`LV_CHART_TYPE_STACKED`: Disegna barre verticali sovrapposte in cui più serie di dati vengono visualizzate come segmenti all'interno di una singola barra per ogni punto dati.

source: :cpp:enumerator:`LV_CHART_UPDATE_MODE_CIRCULAR`: Add the new data in circular fashion, like an ECG diagram.
it_it: :cpp:enumerator:`LV_CHART_UPDATE_MODE_CIRCULAR`: Aggiunge i nuovi dati in modo circolare, come un diagramma ECG.

source: :cpp:enumerator:`LV_CHART_UPDATE_MODE_SHIFT`: Shift old data to the left and add the new one to the right.
it_it: :cpp:enumerator:`LV_CHART_UPDATE_MODE_SHIFT`: Sposta i vecchi dati a sinistra e aggiunge quelli nuovi a destra.

source: :cpp:enumerator:`LV_DIR_ALL`: scroll any directions
it_it: :cpp:enumerator:`LV_DIR_ALL`: scorrimento in qualsiasi direzione

source: :cpp:enumerator:`LV_DIR_BOTTOM`: only scroll down
it_it: :cpp:enumerator:`LV_DIR_BOTTOM`: scorrimento solo verso il basso

source: :cpp:enumerator:`LV_DIR_HOR`: only scroll horizontally
it_it: :cpp:enumerator:`LV_DIR_HOR`: scorrimento solo orizzontalmente

source: :cpp:enumerator:`LV_DIR_LEFT`: only scroll left
it_it: :cpp:enumerator:`LV_DIR_LEFT`: scorrimento solo verso sinistra

source: :cpp:enumerator:`LV_DIR_RIGHT`: only scroll right
it_it: :cpp:enumerator:`LV_DIR_RIGHT`: scorrimento solo verso destra

source: :cpp:enumerator:`LV_DIR_TOP`: only scroll up
it_it: :cpp:enumerator:`LV_DIR_TOP`: scorrimento solo verso l'alto

source: :cpp:enumerator:`LV_DIR_VER`: only scroll vertically
it_it: :cpp:enumerator:`LV_DIR_VER`: scorrimento solo verticalmente

source: :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_DIRECT` The buffer size(s) must match the size of the display.
it_it: :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_DIRECT` La dimensione del buffer deve corrispondere alla dimensione del display.

source: :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_FULL` The buffer size(s) must match the size of the display.
it_it: :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_FULL` La dimensione del buffer deve corrispondere alla dimensione del display.

source: :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_FULL` can work with rotation if the buffer(s) being rendered to are different than the buffer(s) being rotated to in the flush callback and the buffers being rendered to do not have a stride requirement.
it_it: :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_FULL` può funzionare con la rotazione se i buffer in cui viene eseguito il rendering sono diversi dai buffer in cui viene eseguito il rendering nella callback flush e i buffer in cui viene eseguito il rendering non hanno un requisito di passo.

source: :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_PARTIAL` Use the buffer(s) to render to the display using buffers smaller than the size of the display.
it_it: :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_PARTIAL` Utilizzare il/i buffer per eseguire il rendering sul display utilizzando buffer più piccoli delle dimensioni del display.

source: :cpp:enumerator:`LV_EVENT_ALL` can be used instead of :cpp:enumerator:`LV_EVENT_CLICKED` to invoke the callback for all events.
it_it: È possibile utilizzare :cpp:enumerator:`LV_EVENT_ALL` al posto di :cpp:enumerator:`LV_EVENT_CLICKED` per richiamare la callback per tutti gli eventi.

source: :cpp:enumerator:`LV_EVENT_ALL` can be used to receive all events.
it_it: :cpp:enumerator:`LV_EVENT_ALL` può essere utilizzato per ricevere tutti gli eventi.

source: :cpp:enumerator:`LV_EVENT_ALL`: ``"all"``
it_it: :cpp:enumerator:`LV_EVENT_ALL`: ``"tutti"``

source: :cpp:enumerator:`LV_EVENT_CANCEL` Sent when list is closed.
it_it: :cpp:enumerator:`LV_EVENT_CANCEL` Inviato quando l'elenco viene chiuso.

source: :cpp:enumerator:`LV_EVENT_CANCEL`: A process has been cancelled
it_it: :cpp:enumerator:`LV_EVENT_CANCEL`: Un processo è stato annullato

source: :cpp:enumerator:`LV_EVENT_CANCEL`: The *Close* button was clicked.
it_it: :cpp:enumerator:`LV_EVENT_CANCEL`: È stato cliccato il pulsante *Close*.

source: :cpp:enumerator:`LV_EVENT_CHILD_CHANGED`: Child was removed, added, or its size, position were changed
it_it: :cpp:enumerator:`LV_EVENT_CHILD_CHANGED`: Il figlio è stato rimosso, aggiunto o le sue dimensioni o posizione sono state modificate.

source: :cpp:enumerator:`LV_EVENT_CHILD_CREATED`: Child was created, always bubbles up to all parents
it_it: :cpp:enumerator:`LV_EVENT_CHILD_CREATED`: Il figlio è stato creato, viene sempre inoltrato a tutti i genitori.

source: :cpp:enumerator:`LV_EVENT_CHILD_DELETED`: Child was deleted, always bubbles up to all parents
it_it: :cpp:enumerator:`LV_EVENT_CHILD_DELETED`: Il figlio è stato eliminato, viene sempre inoltrato a tutti i genitori.

source: :cpp:enumerator:`LV_EVENT_CLICKED` Sent twice when an item in the ``Browser Panel`` is clicked: once as a result of the input-device :cpp:enumerator:`LV_EVENT_RELEASED` event and a second as a result of the input device :cpp:enumerator:`LV_EVENT_CLICKED` event.
it_it: :cpp:enumerator:`LV_EVENT_CLICKED` Inviato due volte quando si fa clic su un elemento nel ``Pannello Browser``: una volta come risultato dell'evento :cpp:enumerator:`LV_EVENT_RELEASED` del dispositivo di input e una seconda come risultato dell'evento :cpp:enumerator:`LV_EVENT_CLICKED` del dispositivo di input.

source: :cpp:enumerator:`LV_EVENT_CLICKED` Sent when a back button in a header from either main or sidebar is clicked.
it_it: :cpp:enumerator:`LV_EVENT_CLICKED` Inviato quando si clicca su un "back button" in un'intestazione dalla barra principale o laterale.

source: :cpp:enumerator:`LV_EVENT_CLICKED`: Called on release if not scrolled (regardless of long press)
it_it: :cpp:enumerator:`LV_EVENT_CLICKED`: Richiamato al rilascio se non si "scrolla" (indipendentemente dalla pressione prolungata)

source: :cpp:enumerator:`LV_EVENT_CLICKED`: ``"clicked"``
it_it: :cpp:enumerator:`LV_EVENT_CLICKED`: ``"cliccato"``

source: :cpp:enumerator:`LV_EVENT_COLOR_FORMAT_CHANGED`: Sent as a result of any call to `lv_display_set_color_format()`.
it_it: :cpp:enumerator:`LV_EVENT_COLOR_FORMAT_CHANGED`: Inviato come risultato di qualsiasi chiamata a `lv_display_set_color_format()`.

source: :cpp:enumerator:`LV_EVENT_COVER_CHECK`: Check if Widget fully covers an area.
it_it: :cpp:enumerator:`LV_EVENT_COVER_CHECK`: Verifica se il Widget copre completamente un'area.

source: :cpp:enumerator:`LV_EVENT_CREATE`: Widget is being created
it_it: :cpp:enumerator:`LV_EVENT_CREATE`: Il Widget è in fase di creazione

source: :cpp:enumerator:`LV_EVENT_DEFOCUSED`: Widget is defocused
it_it: :cpp:enumerator:`LV_EVENT_DEFOCUSED`: Il Widget ha perso il focus

source: :cpp:enumerator:`LV_EVENT_DELETE`: Widget is being deleted
it_it: :cpp:enumerator:`LV_EVENT_DELETE`: Il Widget è in fase di eliminazione

source: :cpp:enumerator:`LV_EVENT_DOUBLE_CLICKED`: Widget was pressed for a short period of time, and then released without scrolling, for the second time in a click streak.
it_it: :cpp:enumerator:`LV_EVENT_DOUBLE_CLICKED`: Il Widget è stato premuto per un breve periodo di tempo e poi rilasciato senza scorrere, per la seconda volta in una serie di clic.

source: :cpp:enumerator:`LV_EVENT_DRAW_MAIN_BEGIN`, :cpp:enumerator:`LV_EVENT_DRAW_MAIN`, :cpp:enumerator:`LV_EVENT_DRAW_MAIN_END`: Triggered before, during, and after a Widget is drawn, respectively.
it_it: :cpp:enumerator:`LV_EVENT_DRAW_MAIN_BEGIN`, :cpp:enumerator:`LV_EVENT_DRAW_MAIN`, :cpp:enumerator:`LV_EVENT_DRAW_MAIN_END`: Attivati rispettivamente prima, durante e dopo il disegno di un Widget.

source: :cpp:enumerator:`LV_EVENT_DRAW_MAIN_BEGIN`: Starting the main drawing phase
it_it: :cpp:enumerator:`LV_EVENT_DRAW_MAIN_BEGIN`: Avvio della fase di disegno principale

source: :cpp:enumerator:`LV_EVENT_DRAW_MAIN_END`: Finishing the main drawing phase
it_it: :cpp:enumerator:`LV_EVENT_DRAW_MAIN_END`: Termine della fase di disegno principale

source: :cpp:enumerator:`LV_EVENT_DRAW_MAIN`: Perform the main drawing
it_it: :cpp:enumerator:`LV_EVENT_DRAW_MAIN`: Esecuzione del disegno principale

source: :cpp:enumerator:`LV_EVENT_DRAW_POST_BEGIN`, :cpp:enumerator:`LV_EVENT_DRAW_POST`, :cpp:enumerator:`LV_EVENT_DRAW_POST_END`: Triggered before, during, and after all child Widgets are rendered, respectively.
it_it: :cpp:enumerator:`LV_EVENT_DRAW_POST_BEGIN`, :cpp:enumerator:`LV_EVENT_DRAW_POST`, :cpp:enumerator:`LV_EVENT_DRAW_POST_END`: Vengono attivati rispettivamente prima, durante e dopo il rendering di tutti i Widget figli.

source: :cpp:enumerator:`LV_EVENT_DRAW_POST_BEGIN`: Starting the post draw phase (when all children are drawn)
it_it: :cpp:enumerator:`LV_EVENT_DRAW_POST_BEGIN`: Avvio della fase di post-disegno (quando tutti i figli sono stati disegnati)

source: :cpp:enumerator:`LV_EVENT_DRAW_POST_END`: Finishing the post draw phase (when all children are drawn)
it_it: :cpp:enumerator:`LV_EVENT_DRAW_POST_END`: Termine della fase di post-disegno (quando tutti i figli sono stati disegnati)

source: :cpp:enumerator:`LV_EVENT_DRAW_POST`: Perform the post draw phase (when all children are drawn)
it_it: :cpp:enumerator:`LV_EVENT_DRAW_POST`: Esecuzione della fase di post-disegno (quando tutti i figli sono stati disegnati)

source: :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED`: Adding a draw task
it_it: :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED`: Aggiunta di un task di disegno

source: :cpp:enumerator:`LV_EVENT_FLUSH_FINISH`: Sent after :ref:`flush_callback` call has returned.
it_it: :cpp:enumerator:`LV_EVENT_FLUSH_FINISH`: Inviato dopo il ritorno della chiamata a :ref:`flush_callback`.

source: :cpp:enumerator:`LV_EVENT_FLUSH_START`: Sent before :ref:`flush_callback` is called.
it_it: :cpp:enumerator:`LV_EVENT_FLUSH_START`: Inviato prima della chiamata a :ref:`flush_callback`.

source: :cpp:enumerator:`LV_EVENT_FLUSH_WAIT_FINISH`: Sent when the call to `wait_for_flushing()` is about to return, regardless whether any actual waiting occurred.
it_it: :cpp:enumerator:`LV_EVENT_FLUSH_WAIT_FINISH`: Inviato quando la chiamata a `wait_for_flushing()` sta per terminare, indipendentemente dal fatto che si sia verificata un'attesa effettiva.

source: :cpp:enumerator:`LV_EVENT_FLUSH_WAIT_START`: Sent at the beginning of internal call to `wait_for_flushing()` -- happens whether or not any waiting will actually occur.
it_it: :cpp:enumerator:`LV_EVENT_FLUSH_WAIT_START`: Inviato all'inizio della chiamata interna a `wait_for_flushing()` -- si verifica indipendentemente dal fatto che si verifichi effettivamente un'attesa.

source: :cpp:enumerator:`LV_EVENT_FOCUSED`: Widget received focus
it_it: :cpp:enumerator:`LV_EVENT_FOCUSED`: Il Widget ha ricevuto il focus

source: :cpp:enumerator:`LV_EVENT_GESTURE`: A gesture is detected.
it_it: :cpp:enumerator:`LV_EVENT_GESTURE`: È stato rilevato un gesto.

source: :cpp:enumerator:`LV_EVENT_GET_SELF_SIZE`: Get the internal size of a widget
it_it: :cpp:enumerator:`LV_EVENT_GET_SELF_SIZE`: Ottiene la dimensione interna di un widget

source: :cpp:enumerator:`LV_EVENT_HIT_TEST`: Perform advanced hit-testing
it_it: :cpp:enumerator:`LV_EVENT_HIT_TEST`: Esegue un hit-test avanzato

source: :cpp:enumerator:`LV_EVENT_HOVER_LEAVE`: Indev hover leave Widget
it_it: :cpp:enumerator:`LV_EVENT_HOVER_LEAVE`: L'Indev lascia il Widget

source: :cpp:enumerator:`LV_EVENT_HOVER_OVER`: Indev hover over Widget
it_it: :cpp:enumerator:`LV_EVENT_HOVER_OVER`: Passaggio dell'Indev sul Widget

source: :cpp:enumerator:`LV_EVENT_INDEV_RESET`: Indev has been reset
it_it: :cpp:enumerator:`LV_EVENT_INDEV_RESET`: Indev [Input device] è stato resettato

source: :cpp:enumerator:`LV_EVENT_INSERT` Sent right before a character or text is inserted.
it_it: :cpp:enumerator:`LV_EVENT_INSERT` Inviato subito prima dell'inserimento di un carattere o di un testo.

source: :cpp:enumerator:`LV_EVENT_INSERT`: A text is inserted to Widget.
it_it: :cpp:enumerator:`LV_EVENT_INSERT`: Un testo è stato inserito nel Widget.

source: :cpp:enumerator:`LV_EVENT_INVALIDATE_AREA` An area is invalidated (marked for redraw).
it_it: :cpp:enumerator:`LV_EVENT_INVALIDATE_AREA` Un'area viene invalidata (contrassegnata per il ridisegno).

source: :cpp:enumerator:`LV_EVENT_KEY`: A key is sent to Widget.
it_it: :cpp:enumerator:`LV_EVENT_KEY`: Un tasto viene inviato al Widget.

source: :cpp:enumerator:`LV_EVENT_LAYOUT_CHANGED`: The children position has changed due to a layout recalculation
it_it: :cpp:enumerator:`LV_EVENT_LAYOUT_CHANGED`: La posizione degli elementi figlio è cambiata a causa di un ricalcolo del layout

source: :cpp:enumerator:`LV_EVENT_LEAVE`: Widget is defocused but still selected
it_it: :cpp:enumerator:`LV_EVENT_LEAVE`: Il Widget ha perso il focus ma è ancora selezionato

source: :cpp:enumerator:`LV_EVENT_LONG_PRESSED_REPEAT`: Called after `long_press_time` in every `long_press_repeat_time` ms.
it_it: :cpp:enumerator:`LV_EVENT_LONG_PRESSED_REPEAT`: Richiamato dopo `long_press_time` ogni `long_press_repeat_time` ms.

source: :cpp:enumerator:`LV_EVENT_LONG_PRESSED`: Widget has been pressed for at least `long_press_time`.
it_it: :cpp:enumerator:`LV_EVENT_LONG_PRESSED`: Il Widget è stato premuto per almeno `long_press_time`.

source: :cpp:enumerator:`LV_EVENT_PRESSED`: Widget has been pressed
it_it: :cpp:enumerator:`LV_EVENT_PRESSED`: Il Widget è stato premuto

source: :cpp:enumerator:`LV_EVENT_PRESSED`: ``"pressed"``
it_it: :cpp:enumerator:`LV_EVENT_PRESSED`: ``"premuto"``

source: :cpp:enumerator:`LV_EVENT_PRESSING`: Widget is being pressed (called continuously while pressing)
it_it: :cpp:enumerator:`LV_EVENT_PRESSING`: Il Widget è premuto (chiamato continuamente durante la pressione)

source: :cpp:enumerator:`LV_EVENT_PRESS_LOST`: Widget is still being pressed but slid cursor/finger off Widget
it_it: :cpp:enumerator:`LV_EVENT_PRESS_LOST`: Il Widget è ancora premuto, ma il cursore/dito è scivolato fuori dal Widget

source: :cpp:enumerator:`LV_EVENT_READY` Sent when :cpp:enumerator:`LV_KEY_ENTER` is pressed (or sent) to a one-line Text Area.
it_it: :cpp:enumerator:`LV_EVENT_READY` Inviato quando :cpp:enumerator:`LV_KEY_ENTER` viene premuto (o inviato) a una Text Area di una sola riga.

source: :cpp:enumerator:`LV_EVENT_READY` Sent when a directory is opened, which can happen:
it_it: :cpp:enumerator:`LV_EVENT_READY` Inviato all'apertura di una directory, che può verificarsi:

source: :cpp:enumerator:`LV_EVENT_READY` Sent when list is opened.
it_it: :cpp:enumerator:`LV_EVENT_READY` Inviato quando l'elenco viene aperto.

source: :cpp:enumerator:`LV_EVENT_READY` Sent when playback is complete and auto-restart is not enabled.
it_it: :cpp:enumerator:`LV_EVENT_READY` Inviato al termine della riproduzione e con riavvio automatico non abilitato.

source: :cpp:enumerator:`LV_EVENT_READY`: A process has finished
it_it: :cpp:enumerator:`LV_EVENT_READY`: Un processo è terminato

source: :cpp:enumerator:`LV_EVENT_READY`: The *Ok* button was clicked.
it_it: :cpp:enumerator:`LV_EVENT_READY`: È stato cliccato il pulsante *Ok*.

source: :cpp:enumerator:`LV_EVENT_REFRESH` is a special event because it's designed to let the user notify a Widget to refresh itself.
it_it: :cpp:enumerator:`LV_EVENT_REFRESH` è un evento speciale perché è progettato per consentire all'utente di notificare a un widget di aggiornarsi.

source: :cpp:enumerator:`LV_EVENT_REFRESH`: Notify Widget to refresh something on it (for the user)
it_it: :cpp:enumerator:`LV_EVENT_REFRESH`: Notifica al Widget di aggiornare qualcosa (per l'utente)

source: :cpp:enumerator:`LV_EVENT_REFR_EXT_DRAW_SIZE`: Get the required extra draw area around Widget (e.g. for shadow).
it_it: :cpp:enumerator:`LV_EVENT_REFR_EXT_DRAW_SIZE`: Ottiene l'area di disegno aggiuntiva richiesta attorno al Widget (ad esempio per l'ombra).

source: :cpp:enumerator:`LV_EVENT_REFR_READY`: Sent when refreshing has been completed (after rendering and calling :ref:`flush_callback`).
it_it: :cpp:enumerator:`LV_EVENT_REFR_READY`: Inviato al completamento dell'aggiornamento (dopo il rendering e la chiamata a :ref:`flush_callback`).

source: :cpp:enumerator:`LV_EVENT_REFR_REQUEST`: Sent when something happened that requires redraw.
it_it: :cpp:enumerator:`LV_EVENT_REFR_REQUEST`: Inviato quando si è verificato un evento che richiede un ridisegno.

source: :cpp:enumerator:`LV_EVENT_REFR_START`: Sent before a refreshing cycle starts.
it_it: :cpp:enumerator:`LV_EVENT_REFR_START`: Inviato prima dell'inizio di un ciclo di aggiornamento.

source: :cpp:enumerator:`LV_EVENT_RELEASED` Sent once when Slider is released.
it_it: :cpp:enumerator:`LV_EVENT_RELEASED` Inviato una volta quando lo Slider viene rilasciato.

source: :cpp:enumerator:`LV_EVENT_RELEASED`: Called in every cases when Widget has been released
it_it: :cpp:enumerator:`LV_EVENT_RELEASED`: Richiamato ogni volta che il Widget viene rilasciato
